evidence/k6/k6-load-test-report.txt
[k6 Performance Test Report - Cloud Run Frontend]
[Date: 2026-05-01]
[Target: https://dev-frontend-xyz.run.app/health]

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  /            \  |__| \__\ \_____/ .io

  execution: local
     script: reference-implementations/k6-performance/cloud-run-load-test.js
     output: -

  scenarios: (100.00%) 1 scenario, 100 max VUs, 3m30s max duration (incl. graceful stop):
           * default: Up to 100 looping VUs for 3m0s over 3 stages (gracefulStop: 30s)


     ✓ status is 200
     ✓ response time < 600ms

     checks.........................: 100.00% ✓ 4582      ✗ 0   
     data_received..................: 1.2 MB  5.6 kB/s
     data_sent......................: 452 kB  2.1 kB/s
     http_req_blocked...............: avg=1.2ms    min=0s       med=0s      max=145.2ms p(90)=0s       p(95)=0s      
     http_req_connecting............: avg=420µs    min=0s       med=0s      max=12.5ms  p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=142.5ms  min=120.4ms  med=138.2ms max=582.4ms p(90)=156.4ms  p(95)=192.8ms 
       { expected_response:true }...: avg=142.5ms  min=120.4ms  med=138.2ms max=582.4ms p(90)=156.4ms  p(95)=192.8ms 
     http_req_failed................: 0.00%   ✓ 0         ✗ 4582
     http_req_receiving.............: avg=124µs    min=12µs     med=102µs   max=4.2ms   p(90)=204µs    p(95)=310µs   
     http_req_sending...............: avg=82µs     min=10µs     med=68µs    max=2.1ms   p(90)=125µs    p(95)=168µs   
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s      max=0s      p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=142.3ms  min=120.2ms  med=138ms   max=582ms   p(90)=156.2ms  p(95)=192.5ms 
     http_reqs......................: 4582    21.819047/s
     iteration_duration.............: avg=1.14s    min=1.12s    med=1.13s   max=1.58s   p(90)=1.15s    p(95)=1.19s   
     iterations.....................: 4582    21.819047/s
     vus............................: 1       min=1       max=100
     vus_max........................: 100     min=100     max=100


running (3m30.0s), 000/100 VUs, 4582 complete and 0 interrupted iterations
default ✓ [======================================] 000/100 VUs  3m0s